test007/raw_logs/s4_low_concurrency-b1_short_prompt_low_qps.log
Pre-resolved vllm-target-test007-s4-low-concurrency -> [10.106.130.94]
Loading tokenizer: Qwen2.5-0.5B-Instruct
No tokenizer.json for 'Qwen2.5-0.5B-Instruct', trying tiktoken format...
Tiktoken also not available (Tokenizer error: No tiktoken model file found for 'Qwen2.5-0.5B-Instruct'), trying server-side tokenization...
Tokenizer: Server (vocab_size≈131072)
Tokenizer loaded successfully.
Generating 2 random prompts...
Generated 2 prompts in 0.05s
Sampling 2 prompts for verification...
Sample verification passed, skipping full verification.
Starting main benchmark run...
Traffic request rate: 1
Burstiness factor: 1 (Poisson process)
Maximum request concurrency: 2
================= Serving Benchmark Result =================
Successful requests:                     2         
Failed requests:                         0         
Request rate configured (RPS):           1.00      
Benchmark duration (s):                  3.21      
Total input tokens:                      1024      
Total generated tokens:                  256       
Request throughput (req/s):              0.62      
Output token throughput (tok/s):         79.84     
Peak output token throughput (tok/s):    171.00    
Peak concurrent requests:                2.00      
Total token throughput (tok/s):          399.20    
--------------------Time to First Token---------------------
Mean TTFT (ms):                          267.78    
Median TTFT (ms):                        267.78    
P99 TTFT (ms):                           479.48    
P90 TTFT (ms):                           440.60    
----------Time per Output Token (excl. 1st token)-----------
Mean TPOT (ms):                          9.36      
Median TPOT (ms):                        9.36      
P99 TPOT (ms):                           9.63      
P90 TPOT (ms):                           9.58      
--------------------Inter-token Latency---------------------
Mean ITL (ms):                           9.36      
Median ITL (ms):                         9.03      
P99 ITL (ms):                            13.33     
P90 ITL (ms):                            10.21     
---------------------End-to-end Latency---------------------
Mean E2EL (ms):                          1456.27   
Median E2EL (ms):                        1456.27   
P99 E2EL (ms):                           1702.27   
P90 E2EL (ms):                           1657.09   
============================================================
Results saved to /results/test007/raw_json/s4_low_concurrency-b1_short_prompt_low_qps.json

Open-file limit: 1048576